{
  "cells": [
    {
      "cell_type": "markdown",
      "id": "f016f9bc",
      "metadata": {
        "id": "f016f9bc"
      },
      "source": [
        "# ДЗ2\n",
        "\n",
        "Дедлайн: 29 сентября 23:59\n",
        "\n",
        "### Задание 1\n",
        "\n",
        "Вам надо написать программу, которая спрашивает у пользователя три числа (a, b и c), а дальше сообщает пользователю, обладают или не обладают введённые числа следующими свойствами:\n",
        "\n",
        "- `c` является решением линейного уравнения `ax + b = 0` (т.е. `ac + b = 0`)\n",
        "- `a` поделить на `b` равно `c`\n",
        "\n",
        "Важно! Ваша программа не должна ломаться, если одно из введённых чисел является нулём.\n",
        "\n",
        "Пример вывода для введённых чисел 42, 7, 6:\n",
        "\n",
        "```\n",
        "6 не является решением линейного уравнения 42x + 7 = 0\n",
        "46 поделить на 7 равно 6\n",
        "```"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "id": "fb56475e",
      "metadata": {
        "id": "fb56475e",
        "outputId": "f30bbce2-850c-4425-a9d1-4b24dd2c90a8"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "0 является решением линейного уравнения 42x + 0 = 0\n",
            "42 поделить на 0 не равно 0\n"
          ]
        }
      ],
      "source": [
        "\n",
        "def main(a, b, c):\n",
        "  first_answer = 'не является'\n",
        "  if a * c + b == 0:\n",
        "    first_answer = 'является'\n",
        "\n",
        "  print(str(c) + ' ' + first_answer + ' решением линейного уравнения ' + str(a) + 'x + ' + str(b) + ' = 0')\n",
        "\n",
        "  second_answer = 'не равно'\n",
        "\n",
        "  if b != 0 and (a / b) == c:\n",
        "    second_answer = 'равно'\n",
        "\n",
        "  print(str(a) + ' поделить на ' + str(b) + ' ' + second_answer + ' ' + str(c))\n",
        "\n",
        "\n",
        "a = int(input(\"Введите число a: \"))\n",
        "b = int(input(\"Введите число b: \"))\n",
        "c = int(input(\"Введите число c: \"))\n",
        "\n",
        "main(a, b, c)"
      ]
    },
    {
      "cell_type": "markdown",
      "id": "25e2c9c9",
      "metadata": {
        "id": "25e2c9c9"
      },
      "source": [
        "### Задание 2\n",
        "\n",
        "В одном пироге 4 кусочка. Программа следит за поеданием пирогов: в начале спрашивает, сколько вы планируете съесть кусочков, затем выдаёт вам кусочки, а после каждого целого пирога спрашивает, не наелись ли вы, не стоит ли прекратить вас угощать.\n",
        "\n",
        "Пример:"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "id": "7e3b29c4",
      "metadata": {
        "id": "7e3b29c4",
        "outputId": "42e15759-504f-404c-8bf4-e6002ad86188"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "Вот вам кусочек\n",
            "Вот вам кусочек\n",
            "Вот вам кусочек\n",
            "Вот вам кусочек\n",
            "Уже съедено пирогов:  1\n",
            "Продолжаю угощать!\n",
            "Вот вам кусочек\n",
            "Вот вам кусочек\n",
            "Вот вам кусочек\n",
            "Вот вам кусочек\n",
            "Вот, вроде накормили вас!\n",
            "Приходите еще!\n"
          ]
        }
      ],
      "source": []
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "id": "4b27a07e",
      "metadata": {
        "id": "4b27a07e"
      },
      "outputs": [],
      "source": [
        "num_cakes = 0\n",
        "num_slices = 0\n",
        "\n",
        "slices_to_eat = int(input(\"Сколько хотите кусочков?\"))\n",
        "\n",
        "while num_slices < slices_to_eat:\n",
        "  print(\"Вот вам кусочек\")\n",
        "  num_slices += 1\n",
        "\n",
        "  if num_slices == slices_to_eat:\n",
        "    print(\"Вот, вроде накормили вас!\")\n",
        "    break\n",
        "\n",
        "  if num_slices % 4 == 0:\n",
        "    num_cakes += 1\n",
        "    print(\"Уже съедено пирогов: \", num_cakes)\n",
        "    answer = input(\"Ещё? (да / не, спасибо)\")\n",
        "    if answer.lower() == \"нет\" or answer.lower() == \"спасибо\":\n",
        "      print(\"Вот, вроде накормили вас!\")\n",
        "      break\n",
        "    else:\n",
        "      print(\"Продолжаю угощать!\")\n",
        "\n",
        "print(\"Приходите еще!\")"
      ]
    },
    {
      "cell_type": "markdown",
      "id": "c6b06ab8",
      "metadata": {
        "id": "c6b06ab8"
      },
      "source": [
        "### Задание 3\n",
        "\n",
        "Саша всю ночь готовится к игре в города, выписывая все встречающиеся в интернете названия городов. Напишите программу, которая принимает на вход строку с названиями городов, затем одну заглавную букву, и выводит все города из строки, которые на нее начинаются.\n",
        "\n",
        "ВВОД\n",
        "```\n",
        "Строка, которая содержит названия городов, разделенные запятой и пробелом.\n",
        "Заглавная буква.\n",
        "```\n",
        "ВЫВОД\n",
        "```\n",
        "Города из введенной строки, начинающиеся на заданную заглавную букву, каждое название города на новой строке. Если таких городов нет, то программа не должна ничего выдавать.\n",
        "```\n",
        "**Пример:**\n",
        "\n",
        "Ввод\n",
        "```\n",
        "Москва, Киев, Токио, Сеул, Казань, Тверь, Брно, Цюрих, Леон, Малага, Лиссабон, Осло, Ливерпуль\n",
        "Л\n",
        "```\n",
        "Результат\n",
        "```\n",
        "Леон\n",
        "Лиссабон\n",
        "Ливерпуль\n",
        "```"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "id": "8fa32a16",
      "metadata": {
        "id": "8fa32a16",
        "outputId": "702a1415-826a-4752-f90d-67d18b76b8f1"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "Москва\n",
            "Малага\n"
          ]
        }
      ],
      "source": [
        "cities = input().split(\", \")\n",
        "letter = input()\n",
        "\n",
        "\n",
        "for city in cities:\n",
        "  if city[0] == letter:\n",
        "    print(city)"
      ]
    }
  ],
  "metadata": {
    "kernelspec": {
      "display_name": "Python 3 (ipykernel)",
      "language": "python",
      "name": "python3"
    },
    "language_info": {
      "codemirror_mode": {
        "name": "ipython",
        "version": 3
      },
      "file_extension": ".py",
      "mimetype": "text/x-python",
      "name": "python",
      "nbconvert_exporter": "python",
      "pygments_lexer": "ipython3",
      "version": "3.9.6"
    },
    "colab": {
      "provenance": []
    }
  },
  "nbformat": 4,
  "nbformat_minor": 5
}